---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTopOffset
source: html/acd9afaf-d9b6-d042-c030-37f46aad7242.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTopOffset Property

"Top Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTopOffset { get; }
```